'''
接收輸入一群分數(0~100)，由大到小輸出各分數分別有幾人。
人數為 0 者不必輸出。

輸入說明：
第一列，一個大於 0 的整數，代表學生人數(最大值為1000)，例：
50

第二列，指定數量的分數，各分數用空格隔開，例：
85 75 69 84 56 98 78 99 87 79 87 45 87 95 98 97 99 68 78 25 72 84 81 92 49 84 37 62 94 28 94 75 96 84 28 65 79 64 66 86 79 87 82 83 84 97 98 97 96 99


輸出說明:
由大到小每個分數一列，以'分數 人數＇格式輸出, 每一列後不可以有空格，例：
99 3
98 3
97 3
96 2
95 1
94 2
92 1
87 4
86 1
85 1
84 5
83 1
82 1
81 1
79 3
78 2
75 2
72 1
69 1
68 1
66 1
65 1
64 1
62 1
56 1
49 1
45 1
37 1
28 2
25 1
'''
'''
50
85 75 69 84 56 98 78 99 87 79 87 45 87 95 98 97 99 68 78 25 72 84 81 92 49 84 37 62 94 28 94 75 96 84 28 65 79 64 66 86 79 87 82 83 84 97 98 97 96 99
'''
'''
#暴力解
students = int(input())
scores = list(map(int, input().split()))
for i in range(100, -1, -1):
    c = 0
    for j in range(students):
        if i == scores[j]:
            c += 1
    if c != 0:
        print(i, c)
'''
#序號當參數
N = int(input())
a = list(map(int, input().split()))

p = [0] * 101
for i in a:
    p[i] += 1
for i in range(100, -1, -1):
    if p[i] != 0:
        print(i, p[i])
