'''
精準打擊

有一款超進化無人機，它會先觀測前方一整排建物的價值，並計算出每棟建物的價值指數。
然後會以10個建物為一組，計算出每一組建物的最大價值指數的和，再把最大和的該組建物的座標傳給火炮。
若最大價值指數的和有多組相同者，會傳送最左邊一組的座標。
給定一排建物的價值指數，請輸出超進化無人機傳送的座標(該組建物在陣列中的起始與結束序號)。

例:
共有13個建物，其價值指數如下:
1 1 2 1 1 1 1 1 1 1 1 1 1
則:
10個建物為一組的價值指數的總和
0~9 => 11
1~10 => 11
2~11 => 11
3~12 => 10
最大價值指數的和為11, 有3組相同
輸出最左邊一組的座標 0 9


範例1 輸入:
12
1 1 1 1 1 1 1 1 1 2 1 1

範例1 輸出:
0 9

說明:
0 9
1 10
2 11
之和均為 11
傳送最左邊一組的座標

範例2 輸入:
13
1 1 1 1 1 1 2 1 1 1 1 1 5

範例2 輸出:
3 12

說明:
3 12
之和15，為最大基準值的和


範例3 輸入:
26
1 1 1 1 1 1 2 1 1 1 1 1 5 1 1 1 1 1 1 2 11 1 1 1 1 5

範例3 輸出
11 20

'''
#Slide Window
N = int(input())
a = list(map(int, input().split()))

answer = 0
allTotal = 0

total = 0

for i in range(10):
    total += a[i]
if total > allTotal:
    allTotal = total
    answer = i

for i in range(1, N - 9):
    total -= a[i - 1]
    if total > allTotal:
        allTotal = total
        answer = i
print(answer, answer + 9)
